namespace OpticsShop.Services.Printer
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    internal class MainTitle
    {
        public MainTitle()
        {
            PrintTitle();
        }

        private void PrintTitle()
        {
            Console.WriteLine(
                "   ██████╗ ██████╗ ████████╗██╗███╗   ███╗██╗   ██╗███████╗\r\n  " +
                "██╔═══██╗██╔══██╗╚══██╔══╝██║████╗ ████║██║   ██║██╔════╝\r\n  " +
                "██║   ██║██████╔╝   ██║   ██║██╔████╔██║██║   ██║███████╗\r\n  " +
                "██║   ██║██╔═══╝    ██║   ██║██║╚██╔╝██║██║   ██║╚════██║\r\n  " +
                "╚██████╔╝██║        ██║   ██║██║ ╚═╝ ██║╚██████╔╝███████║\r\n   " +
                "╚═════╝ ╚═╝        ╚═╝   ╚═╝╚═╝     ╚═╝ ╚═════╝ ╚══════╝\r\n\r\n               " +
                "               ПРАЙМ ОПТИКА");
            Console.WriteLine("\r\n");
            Console.WriteLine("Добре дошли в сайта на оптики \"Оптимус Прайм\"!\r\n" +
                "Тук можете да запишете преглед при офталмолог да изберете новите си очила или лещи.\r\n" +
                "Възползвайте се от намаления и промоции на избрани марки рамки и стъкла.\r\n" +
                "Разговаряйте с нашите специалисти и направете май-добрият избор за вашето зрение.");

        }
    }
}
